Repository: ina-hiroshi/MioCam
Catalog: MioCam/Resources/*.lproj/Localizable.strings
Languages: es, ja, ko, pt_br

# live_view_title
source: Live View
es: Vista en vivo
ja: ライブビュー
ko: 라이브 뷰
pt_br: Visualização ao vivo

# end_monitor_title
source: End monitor?
es: ¿Terminar monitor?

# end_monitor_message
source: Ending the monitor will disconnect from the camera.
es: Terminar el monitor desconectará de la cámara.

source: Continue
es: Continuar

# end_monitor
source: End
es: Terminar

source: Connection Error
es: Error de conexión
ja: 接続エラー
ko: 연결 오류
pt_br: Erro de conexão

# connection_timeout
source: Connection timed out
es: Conexión agotada
ja: 接続がタイムアウトしました
ko: 연결 시간 초과
pt_br: Conexão expirou

source: Reconnecting...
es: Reconectando...
ja: 再接続中...
ko: 재연결 중...
pt_br: Reconectando...

source: Connecting...
es: Conectando...
ja: 接続中...
ko: 연결 중...
pt_br: Conectando...

# connection_please_retry
source: Connection is taking a while. Please try again.
es: La conexión tarda. Inténtelo de nuevo.
ja: 接続に時間がかかっています。もう一度お試しください。
ko: 연결이 지연되고 있습니다. 다시 시도해 주세요.
pt_br: A conexão está demorando. Tente novamente.

source: Retry
es: Reintentar
ja: 再試行
ko: 재시도
pt_br: Tentar novamente

# auth_required
source: Authentication required
es: Autenticación requerida
ja: 認証が必要です
ko: 인증이 필요합니다
pt_br: Autenticação necessária

# connection_timing_out
source: Connection is taking a while. Please check your network connection.
es: La conexión tarda. Verifique su red.
ja: 接続に時間がかかっています。ネットワーク接続を確認してください。
ko: 연결이 지연되고 있습니다. 네트워크 연결을 확인해 주세요.
pt_br: A conexão está demorando. Verifique sua rede.

source: Camera not found
es: Cámara no encontrada
ja: カメラが見つかりません
ko: 카메라를 찾을 수 없습니다
pt_br: Câmera não encontrada

# camera_offline
source: Camera is offline
es: Cámara desconectada
ja: カメラがオフラインです
ko: 카메라 오프라인
pt_br: Câmera offline

source: Camera went offline
es: La cámara se desconectó
ja: カメラがオフラインになりました
ko: 카메라가 오프라인되었습니다
pt_br: A câmera ficou offline

source: Connection lost
es: Conexión perdida
ja: 接続が切断されました
ko: 연결 끊김
pt_br: Conexão perdida

# connection_lost_reconnect_failed
source: Connection lost. Reconnection failed.
es: Conexión perdida. Reconexión fallida.
ja: 接続が切断されました。再接続に失敗しました。
ko: 연결이 끊어졌습니다. 재연결에 실패했습니다.
pt_br: Conexão perdida. Falha na reconexão.

# camera_info_fetch_failed
source: Failed to get camera info: %@
es: Error al obtener info. de cámara: %@
ja: カメラ情報の取得に失敗しました: %@
ko: 카메라 정보를 가져오지 못했습니다: %@
pt_br: Falha ao obter info. da câmera: %@

source: Camera info unavailable
es: Info. de cámara no disponible
ja: カメラ情報が取得できません
ko: 카메라 정보를 사용할 수 없습니다
pt_br: Info. da câmera indisponível

# answer_set_failed
source: Failed to set Answer: %@
es: Error al establecer Answer: %@
ja: Answerの設定に失敗しました: %@
ko: Answer 설정 실패: %@
pt_br: Falha ao definir Answer: %@

# answer_receive_failed
source: Failed to receive Answer: %@
es: Error al recibir Answer: %@
ja: Answerの受信に失敗しました: %@
ko: Answer 수신 실패: %@
pt_br: Falha ao receber Answer: %@

# scan_qr_prompt
source: Scan the camera's QR code
es: Escanee el código QR de la cámara
ja: カメラのQRコードを読み取ってください
ko: 카메라의 QR 코드를 스캔하세요
pt_br: Escaneie o QR da câmera

# code_manual_entry
source: Enter code manually
es: Introducir código manualmente
ja: コードを手入力する
ko: 코드 직접 입력
pt_br: Inserir código manualmente

# qr_scan_title
source: QR Scan
es: Escanear QR
ja: QRスキャン
ko: QR 스캔
pt_br: Escanear QR

source: Cancel
es: Cancelar
ja: キャンセル
ko: 취소
pt_br: Cancelar

# camera_pairing_info
source: Enter the camera pairing information
es: Introduzca la información de emparejamiento de la cámara
ja: カメラのペアリング情報を入力してください
ko: 카메라 페어링 정보를 입력하세요
pt_br: Insira as informações de pareamento da câmera

source: Camera ID
es: ID de cámara
ja: カメラID
ko: 카메라 ID
pt_br: ID da câmera

# camera_id_hint
source: Enter the Camera ID displayed on the camera screen
es: Introduzca el ID de cámara mostrado en la pantalla de la cámara
ja: カメラ側の画面に表示されているカメラIDを入力してください
ko: 카메라 화면에 표시된 카메라 ID를 입력하세요
pt_br: Insira o ID da câmera exibido na tela da câmera

# camera_id_placeholder
source: Enter Camera ID
es: Introduzca ID de cámara
ja: カメラIDを入力
ko: 카메라 ID 입력
pt_br: Insira ID da câmera

source: Pairing Code
es: Código de emparejamiento
ja: ペアリングコード
ko: 페어링 코드
pt_br: Código de pareamento

# pairing_code_hint
source: 6-character alphanumeric code (e.g., ABC123)
es: Código alfanumérico de 6 caracteres (ej.: ABC123)
ja: 6桁の英数字コード（例: ABC123）
ko: 6자리 영숫자 코드(예: ABC123)
pt_br: Código alfanumérico de 6 caracteres (ex.: ABC123)

# pairing_code_placeholder
source: Enter 6-character code
es: Introduzca código de 6 caracteres
ja: 6桁のコードを入力
ko: 6자리 코드 입력
pt_br: Insira código de 6 caracteres

# pairing
source: Pair
es: Emparejar
ja: ペアリング
ko: 페어링
pt_br: Parear

# manual_entry_title
source: Manual Entry
es: Entrada manual
ja: 手入力
ko: 직접 입력
pt_br: Entrada manual

# invalid_qr_message
source: Invalid QR code. Please scan the QR from the camera app.
es: Código QR inválido. Escanee el QR de la app de cámara.
ja: 無効なQRコードです。カメラアプリのQRを読み取ってください。
ko: 잘못된 QR 코드입니다. 카메라 앱의 QR을 스캔해 주세요.
pt_br: QR inválido. Escaneie o QR do app da câmera.

source: Camera
es: Cámara
ja: カメラ
ko: 카메라
pt_br: Câmera

# select_role_prompt
source: Select this device's role
es: Seleccione el rol de este dispositivo
ja: このデバイスの役割を選んでください
ko: 이 기기의 역할을 선택하세요
pt_br: Selecione a função deste dispositivo

# camera_role
source: Camera
es: Cámara
ja: カメラ
ko: 카메라
pt_br: Câmera

# camera_role_desc
source: Stream video from this device
es: Transmitir video desde este dispositivo
ja: このデバイスで映像を配信します
ko: 이 기기에서 영상 스트리밍
pt_br: Transmitir vídeo deste dispositivo

# monitor_role_desc
source: View video from another device
es: Ver video de otro dispositivo
ja: 別のデバイスの映像を見ます
ko: 다른 기기의 영상 보기
pt_br: Ver vídeo de outro dispositivo

source: Sign Out
es: Cerrar sesión
ja: サインアウト
ko: 로그아웃
pt_br: Sair

# tagline
source: Turn your device into the world's simplest care window.
es: Convierta su dispositivo en la ventana de cuidado más simple del mundo.
ja: お手持ちの端末を、世界一シンプルな見守り窓に。
ko: 기기를 세계에서 가장 간단한 케어 창으로 만드세요.
pt_br: Transforme seu dispositivo na janela de cuidado mais simples do mundo.

# sign_in_apple_prompt
source: Get started easily with Sign in with Apple
es: Comience fácilmente con Inicio de sesión con Apple
ja: Sign in with Appleで簡単に始められます
ko: Apple로 로그인으로 간편하게 시작하세요
pt_br: Comece facilmente com Entrar com Apple

# auth_error_simulator
source: Authentication error. Please run on a real device. Sign in with Apple may not work correctly in the simulator.
es: Error de autenticación. Ejecute en un dispositivo real.
ja: 認証エラーが発生しました。実機で実行していることを確認してください。シミュレーターではSign in with Appleが正しく動作しない場合があります。
ko: 인증 오류. 실제 기기에서 실행해 주세요.
pt_br: Erro de autenticação. Execute em dispositivo real.

# auth_canceled
source: Authentication was canceled.
es: Autenticación cancelada.
ja: 認証がキャンセルされました。
ko: 인증이 취소되었습니다.
pt_br: Autenticação cancelada.

# auth_invalid_response
source: Invalid authentication response.
es: Respuesta de autenticación inválida.
ja: 無効な認証応答が返されました。
ko: 잘못된 인증 응답입니다.
pt_br: Resposta de autenticação inválida.

# auth_not_handled
source: Authentication request could not be processed.
es: No se pudo procesar la solicitud de autenticación.
ja: 認証リクエストが処理できませんでした。
ko: 인증 요청을 처리할 수 없습니다.
pt_br: Solicitação de autenticação não processada.

# auth_failed
source: Authentication failed.
es: Autenticación fallida.
ja: 認証に失敗しました。
ko: 인증에 실패했습니다.
pt_br: Autenticação falhou.

# auth_not_interactive
source: Authentication could not be handled interactively.
es: La autenticación no pudo realizarse interactivamente.
ja: 認証が対話的に処理できませんでした。
ko: 인증을 대화형으로 처리할 수 없습니다.
pt_br: Autenticação não pôde ser processada interativamente.

# auth_matched_excluded
source: Matched excluded credential.
es: Credencial excluida coincidente.
ja: 除外された認証情報が一致しました。
ko: 제외된 자격 증명이 일치합니다.
pt_br: Credencial excluída correspondente.

# auth_unknown_error
source: Unknown authentication error: %@
es: Error de autenticación desconocido: %@
ja: 不明な認証エラー: %@
ko: 알 수 없는 인증 오류: %@
pt_br: Erro de autenticação desconhecido: %@

# auth_device_setting_error
source: Device settings issue. Please run on a real device.
es: Problema de configuración del dispositivo. Ejecute en un dispositivo real.
ja: デバイスの設定に問題があります。実機で実行していることを確認してください。
ko: 기기 설정에 문제가 있습니다. 실제 기기에서 실행해 주세요.
pt_br: Problema nas configurações do dispositivo. Execute em dispositivo real.

source: Pairing Error
es: Error de emparejamiento
ja: ペアリングエラー
ko: 페어링 오류
pt_br: Erro de pareamento

source: No paired cameras
es: Sin cámaras emparejadas
ja: ペアリング済みのカメラがありません
ko: 페어링된 카메라 없음
pt_br: Nenhuma câmera pareada

# scan_to_pair
source: Scan the camera's QR code to pair
es: Escanee el código QR de la cámara para emparejar
ja: カメラのQRコードを読み取って ペアリングしましょう
ko: 카메라의 QR 코드를 스캔하여 페어링하세요
pt_br: Escaneie o QR da câmera para parear

# qr_scan_button
source: Scan QR Code
es: Escanear código QR
ja: QRコードをスキャン
ko: QR 코드 스캔
pt_br: Escanear código QR

# cameras_connected_format
source: %d connected
es: %d conectados
ja: %d台接続中
ko: %d개 연결됨
pt_br: %d conectados

source: Loading...
es: Cargando...
ja: 読み込み中...
ko: 로딩 중...
pt_br: Carregando...

# pairing_in_progress
source: Pairing...
es: Emparejando...
ja: ペアリング中...
ko: 페어링 중...
pt_br: Pareando...

source: Show QR Code
es: Mostrar código QR
ja: QRコードを表示
ko: QR 코드 표시
pt_br: Mostrar código QR

source: Regenerate Pairing Code
es: Regenerar código de emparejamiento
ja: ペアリングコードを再生成
ko: 페어링 코드 재생성
pt_br: Regenerar código de pareamento

source: Connected Monitors
es: Monitores conectados
ja: 接続中のモニター
ko: 연결된 모니터
pt_br: Monitores conectados

source: No connected monitors
es: Sin monitores conectados
ja: 接続中のモニターはありません
ko: 연결된 모니터 없음
pt_br: Nenhum monitor conectado

source: Camera Name
es: Nombre de cámara
ja: カメラ名
ko: 카메라 이름
pt_br: Nome da câmera

# camera_name_placeholder
source: Enter camera name
es: Introduzca nombre de cámara
ja: カメラ名を入力
ko: 카메라 이름 입력
pt_br: Insira nome da câmera

source: Stop Camera
es: Detener cámara
ja: カメラを停止する
ko: 카메라 중지
pt_br: Parar câmera

source: Account
es: Cuenta
ja: アカウント
ko: 계정
pt_br: Conta

source: Version
es: Versión
ja: バージョン
ko: 버전
pt_br: Versão

# camera_settings_title
source: Camera Settings
es: Configuración de cámara
ja: カメラ設定
ko: 카메라 설정
pt_br: Configurações da câmera

source: Done
es: Listo
ja: 完了
ko: 완료
pt_br: Concluído

source: Regenerate
es: Regenerar
ja: 再生成
ko: 재생성
pt_br: Regenerar

# regenerate_pairing_alert_message
source: Regenerate the pairing code.
es: Regenerar el código de emparejamiento.
ja: ペアリングコードを再生成します。
ko: 페어링 코드를 재생성합니다.
pt_br: Regenerar o código de pareamento.

# regenerate_pairing_alert_detail
source: Regenerating will disconnect all monitors. Continue?
es: Regenerar desconectará todos los monitores. ¿Continuar?
ja: 再生成すると、現在接続中のモニターはすべて切断されます。続けますか？
ko: 재생성하면 연결된 모든 모니터가 연결 해제됩니다. 계속하시겠습니까?
pt_br: Regenerar desconectará todos os monitores. Continuar?

source: Stop
es: Detener
ja: 停止
ko: 중지
pt_br: Parar

# stop_camera_alert_message
source: Stopping the camera will disconnect all monitors.
es: Detener la cámara desconectará todos los monitores.
ja: カメラを停止すると、すべてのモニターとの接続が切断されます。
ko: 카메라를 중지하면 모든 모니터와의 연결이 끊어집니다.
pt_br: Parar a câmera desconectará todos os monitores.

# camera_not_registered
source: Camera is not registered. Please start the camera and try again.
es: Cámara no registrada. Inicie la cámara e intente de nuevo.
ja: カメラが登録されていません。カメラを起動してから再度お試しください。
ko: 카메라가 등록되지 않았습니다. 카메라를 실행한 후 다시 시도해 주세요.
pt_br: Câmera não registrada. Inicie a câmera e tente novamente.

# pairing_alternative
source: Pair without QR code
es: Emparejar sin código QR
ja: QRコード以外でペアリングする
ko: QR 없이 페어링
pt_br: Parear sem QR

source: Tap to copy
es: Toque para copiar
ja: タップしてコピー
ko: 탭하여 복사
pt_br: Toque para copiar

# back_to_qr
source: Back to QR code
es: Volver al código QR
ja: QRコードに戻る
ko: QR 코드로 돌아가기
pt_br: Voltar ao QR

# qr_instruction
source: Scan this QR code on the monitor
es: Escanee este código QR en el monitor
ja: モニターでこのQRコードを読み取ってください
ko: 모니터에서 이 QR 코드를 스캔하세요
pt_br: Escaneie este QR no monitor

# qr_code_title
source: QR Code
es: Código QR
ja: QRコード
ko: QR 코드
pt_br: Código QR

source: Close
es: Cerrar
ja: 閉じる
ko: 닫기
pt_br: Fechar

source: Camera access required
es: Acceso a cámara requerido
ja: カメラへのアクセスが必要です
ko: 카메라 액세스 필요
pt_br: Acesso à câmera necessário

# camera_access_hint
source: Please allow camera access in Settings
es: Permita el acceso a la cámara en Ajustes
ja: 設定アプリからカメラへのアクセスを許可してください
ko: 설정에서 카메라 액세스를 허용하세요
pt_br: Permita o acesso à câmera em Ajustes

source: Open Settings
es: Abrir Ajustes
ja: 設定を開く
ko: 설정 열기
pt_br: Abrir Ajustes

# camera_access_alert_title
source: Camera Access
es: Acceso a cámara
ja: カメラへのアクセス
ko: 카메라 액세스
pt_br: Acesso à câmera

# camera_access_alert_message
source: To use the camera, please allow camera access in Settings.
es: Para usar la cámara, permita el acceso en Ajustes.
ja: カメラを使用するには、設定アプリでカメラへのアクセスを許可してください。
ko: 카메라를 사용하려면 설정에서 카메라 액세스를 허용하세요.
pt_br: Para usar a câmera, permita o acesso em Ajustes.

source: Camera registration failed
es: Error al registrar la cámara
ja: カメラ登録に失敗しました
ko: 카메라 등록 실패
pt_br: Falha ao registrar a câmera

# waiting_for_monitors
source: Waiting for monitors to connect...
es: Esperando monitores...
ja: モニターの接続を待っています...
ko: 모니터 연결 대기 중...
pt_br: Aguardando monitores...

# camera_preparing
source: Preparing camera...
es: Preparando cámara...
ja: カメラを準備中...
ko: 카메라 준비 중...
pt_br: Preparando câmera...

source: User Name
es: Nombre de usuario
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome do usuário

# display_name_placeholder
source: Enter display name
es: Introduzca nombre para mostrar
ja: 表示名を入力
ko: 표시 이름 입력
pt_br: Insira nome para exibir

source: Save
es: Guardar
ja: 保存
ko: 저장
pt_br: Salvar

source: Delete Account
es: Eliminar cuenta
ja: アカウントを削除
ko: 계정 삭제
pt_br: Excluir conta

# settings_title
source: Settings
es: Ajustes
ja: 設定
ko: 설정
pt_br: Ajustes

# delete_account_confirm
source: Your account and data will be permanently deleted. Delete?
es: Su cuenta y datos se eliminarán permanentemente. ¿Eliminar?
ja: アカウントとデータは完全に削除され、元に戻せません。削除しますか？
ko: 계정과 데이터가 영구적으로 삭제됩니다. 삭제하시겠습니까?
pt_br: Sua conta e dados serão excluídos permanentemente. Excluir?

# display_name_required
source: Please enter a name
es: Introduzca un nombre
ja: 名前を入力してください
ko: 이름을 입력하세요
pt_br: Insira um nome

# delete_account_reauth_message
source: Sign in again to delete your account
es: Inicie sesión de nuevo para eliminar su cuenta
ja: アカウント削除のため、再度サインインしてください
ko: 계정 삭제를 위해 다시 로그인하세요
pt_br: Entre novamente para excluir sua conta

# delete_account_title
source: Delete Account
es: Eliminar cuenta
ja: アカウント削除
ko: 계정 삭제
pt_br: Excluir conta

source: Camera Info
es: Info. de cámara
ja: カメラ情報
ko: 카메라 정보
pt_br: Info. da câmera

source: Device Model
es: Modelo de dispositivo
ja: 機種
ko: 기기 모델
pt_br: Modelo do dispositivo

source: Connection Status
es: Estado de conexión
ja: 接続状態
ko: 연결 상태
pt_br: Status da conexão

source: Status
es: Estado
ja: ステータス
ko: 상태

source: Online
es: En línea
ja: オンライン
ko: 온라인

source: Offline
es: Desconectado
ja: オフライン
ko: 오프라인

source: Battery
es: Batería
ja: バッテリー
ko: 배터리
pt_br: Bateria

source: Disconnect Camera
es: Desconectar cámara
ja: カメラの接続を解除
ko: 카메라 연결 해제
pt_br: Desconectar câmera

# monitor_settings_title
source: Monitor Settings
es: Configuración de monitor
ja: モニター設定
ko: 모니터 설정
pt_br: Configurações do monitor

source: Disconnect
es: Desconectar
ja: 接続を解除
ko: 연결 해제
pt_br: Desconectar

# disconnect_button
source: Disconnect
es: Desconectar
ja: 解除
ko: 해제
pt_br: Desconectar

# delete_confirm
source: Delete
es: Eliminar
ja: 削除する
ko: 삭제
pt_br: Excluir

# disconnect_confirm_message
source: Disconnect from this camera? You will need to scan the QR code again to reconnect.
es: ¿Desconectar de esta cámara? Deberá escanear el código QR para reconectar.
ja: このカメラとの接続を解除しますか？再度接続するにはQRコードのスキャンが必要です。
ko: 이 카메라와의 연결을 해제하시겠습니까? 다시 연결하려면 QR 코드를 스캔해야 합니다.
pt_br: Desconectar desta câmera? Será necessário escanear o QR para reconectar.

source: Unknown
es: Desconocido
ja: 不明
ko: 알 수 없음
pt_br: Desconhecido

source: Anonymous User
es: Usuario anónimo
ja: 匿名ユーザー
ko: 익명 사용자
pt_br: Usuário anônimo

# monitor_role
source: Monitor
ja: モニター
ko: 모니터

# monitor_title
source: Monitor
ja: モニター
ko: 모니터

source: Error
ja: エラー
ko: 오류
pt_br: Erro
